000100 IDENTIFICATION DIVISION.
000150 PROGRAM-ID. HANGMAN.
000200 AUTHOR. TTC.
000250 
000300 DATA DIVISION.
000350 WORKING-STORAGE SECTION.
000400 01 SECRET-WORD PIC X(9) VALUE 'SENSELESS'.  * WORD TO BE GUESSED.
000450 01 GUESS-WORD PIC X(9) VALUE '*********'.  * CONTAINS CURRENT CHARS OF GUESSED WORD
000500 01 GUESS-CHAR PIC X.  * CHARACTER GUESSED BY THE PLAYER.
000550 01 GUESS-COUNT PIC 99 VALUE 0.  * COUNTER FOR NUMBER OF GUESSES.
000600 01 GUESSED PIC X VALUE 'N'.  * FLAG TO INDICATE IF THE WORD HAS BEEN GUESSED.
000650 01 I PIC 99.  * INDEX COUNTER FOR LOOPING OVER THE WORD.
000700 
000750 PROCEDURE DIVISION.
000800 MAIN-PARAGRAPH.
000850     DISPLAY '-- HANGMAN - GAME --'.
000900     DISPLAY '-- GUESS - THE - WORD! --'.
000950     DISPLAY 'YOU HAVE 10 TRIES.'.
001000 	
001050 	   PERFORM GUESS-PARAGRAPH UNTIL GUESSED = 'Y' OR GUESS-COUNT = 10.
001100 	
001150 	   IF GUESSED = 'Y' THEN
001200 		   DISPLAY 'CONGRATULATIONS! YOU GUESSED ''' SECRET-WORD ''' IN ' GUESS-COUNT ' TRIES!'
001250 	   ELSE
001300 	       IF GUESS-COUNT = 10
001350 		       DISPLAY 'SORRY! YOU LOST. YOU COULD NOT GUESS ''' SECRET-WORD ''' IN TEN TRIES.'
001400 		   END-IF
001450 	   END-IF.
001500 	   DISPLAY '-- GAME - END - GOODBYE --'.
001550 	   STOP RUN.
001600 END-PARAGRAPH.
001650 
001700 GUESS-PARAGRAPH.
001750     DISPLAY 'CURRENT WORD: ' GUESS-WORD.
001800 	   DISPLAY 'YOUR GUESS: ' WITH NO ADVANCING.
001850 	   ACCEPT GUESS-CHAR.
001900 	
001950 	   MOVE 1 TO I.
002000 	   PERFORM VARYING I FROM 1 BY 1 UNTIL I = 10  * UNTIL LENGTH OF SECRET-WORD
002050 		   IF GUESS-CHAR = SECRET-WORD(I:1) THEN  * IF GUESSED CHAR IS CORRECT
002100 	    	   MOVE GUESS-CHAR TO GUESS-WORD(I:1)  * REPLACE THE ASTERISK WITH THE GUESSED CHAR
002150 		   END-IF
002200 	   END-PERFORM.
002250 	
002300 	   IF SECRET-WORD = GUESS-WORD
002350 		   MOVE 'Y' TO GUESSED
002400 	   END-IF.
002450 	   ADD 1 TO GUESS-COUNT.
002500 END-PARAGRAPH.
002550 
002600 END PROGRAM HANGMAN.
